[
  {
  "version": "0.0.4.8",
  "date": "2025-11-11",
  "changes": [
    "Renamed 'target_id' → 'user_id' in moderation actions (ban, mute, etc.)",
    "Fixes Pylance errors for missing or mismatched parameters",
    "Ensures DB logging uses consistent user_id field for target users",
    "Made template and static directory paths absolute using BASE_DIR to ensure FastAPI finds resources when running under systemd/AWS environments",
    "Escaped nested f-string braces in fallback HTML to fix Pylance syntax errors",
    "Verified index.html and static assets render correctly on production",
    "Resolved Pylance type error in `add_case` by ensuring `latrowid` always returns an integer.",
    "Added a fallback query to guarentee a valid case ID is returned even if SQLite returns `None`."
  ]
  },
  {

  "version": "0.0.4.7",
  "date": "2025-11-02",
  "changes": [
    "Hardened Discord OAuth: fail fast on bad env config, enforce CSRF state, clearer token exchange errors.",
    "Added optional ?debug=1 on /auth/callback to surface Discord error payloads for troubleshooting."
  ]
  },
  {
    "version":"0.0.4.7",
    "date":"2025-11-02",
    "changes": [
      "OAuth: Removed prompt=none to fix “Invalid Form Body” on mobile / in-app browsers.",
      "Security: Added CSRF state generation and verification for the Discord OAuth flow.",
      "UX: New /auth/start interstitial to help users open the flow in their system browser if Discord's in-app webview misbehaves.",
      "Reliability: Callback now returns clearer JSON on token/userinfo failures and disables caching for error responses."
    ]
  },
  {
  "version": "0.0.4.6",
  "date": "2025-11-01",
  "changes": [
    "Switched dashboard auth from token-based links to Discord OAuth sessions.",
    "Dashboard and guild settings now require login and guild membership.",
    "Changelog and Status pages are public: /changelog, /status (+ /api/*).",
    "Fixed dependency issue by replacing lambda Depends with `_member_dep`.",
    "Improved status snapshot robustness for CurseForge last-check timestamp."
  ],
  "notes": [
    "BREAKING: Remove token auth. Set SESSION_SECRET, OAUTH_CLIENT_ID, OAUTH_CLIENT_SECRET, OAUTH_REDIRECT_URI."
  ]
  },
  {
    "version": "0.0.4.5",
    "date": "2025-10-31",
    "changes": [
      "Fixed dashboard load error caused by unescaped braces in changelog template",
      "Removed unsupported audioop-lts dependency to ensure compatibility with Python 3.12",
      "Improved deployment stability and logging clarity on EC2",
      "Refined internal redeploy script for safer updates"
    ]
  },
  {
    "version": "0.0.4.4",
    "date": "2025-10-26",
    "changes": [
      "Initial CurseForge updates cog integration",
      "Minor UI adjustments on dashboard"
    ]
  },
  {
    "version": "0.0.4.4",
    "date": "2025-10-25",
    "changes": [
      "Changelog API and UI added",
      "Dashboard theme + avatar polish",
      "Counting fixes for scientific notation and unicode digits"
    ]
  },
  {
    "version": "0.0.4.3",
    "date": "2025-10-24",
    "changes": [
      "Initial CelestiGuard release",
      "Counting cog + dashboard",
      "Cloudflare-free AWS deploy with Nginx + Certbot"
    ]
  }
]
